# Projeto de Bases de Dados - Parte 2

### Docente Responsável

Prof. André Patrício
Prof. Jorge Oliveira

### Grupo 4
<dl>
    <dt>HH horas (33.3%)</dt>
    <dd>ist102447 Guilherme Belchior</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>ist103095 Daniel Nunes</dd>
    <dt>HH horas (33.3%)</dt>
    <dd>ist102078 João Costa</dd>
<dl>

# Empresa de comércio online

## 1 Conversão E-A para Modelo Relacional

Recorde a notação para o Modelo Relacional exposta nas aulas teóricas como se segue:

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

1. As relações são expressas por um nome seguido dos atributos entre parêntesis;
    - As chave primárias são expressas sublinhando os atributos que a compõem;
    - As chaves estrangeiras para outras relações são expressas através da lista de atributos que a compõem, seguida de “: FK(RelacaoDestino)”. A ordem dos atributos que compõem a FK deve corresponder à ordem dos atributos da chave na relação destino;
    - As chaves candidatas são expressas através da expressão “unique”, seguida da lista de atributos que a compõem entre parêntesis;
    - As restrições de integridade ao Modelo Relacional são descritas em termos dos conceitos deste modelo.

### 1.1 Modelo Relacional com Restrições de Integridade

1. Desenvolva um Modelo Relacional correspondente ao modelo Entidade-Associação;
2. Complemente a seu Modelo Relacional com um conjunto de Restrições de Integridade que represente o modelo E-A apresentado com a maior fidelidade.

- relacaoA (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoB (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoC (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoD (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)
- relacaoE (<u>atributo1</u>, … , atributoN)
    - atributoX, … , atributoZ: FK (RelacaoDestino)
    - unique(atributoA, … , AtributoC)

### 1.2 Restrições de Integridade não passíveis de conversão

Identifique todas as Restrições de Integridade do modelo Entidade-Associação apresentado que não são passíveis de conversão para o modelo relacional.

## 2 Algebra Relacional

Recorde a notação exposta nas aulas teóricas como se segue:

$\Pi_{atributo1} \big( \sigma_{atributo1=atributo2} (relacaoA \bowtie relacaoB) \big)$

#### Simbolos
- $\cup$ union 			
- $\cap$ intersection 		
- $-$ difference 		
- $\times$ cartesian product 
- $\div$ division 			
- $\rho$ rename 			
- $\bowtie$ natural join 		
- $\wedge$ Logical AND 	
- $\vee$ Logical OR 	
- $\neg$ Logical NOT 	

Considerando o modelo relacional desenvolvido, apresente as expressões algébricas correspondentes a cada uma das seguintes interrogações:

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

$\Pi_{c.name} (Customer \bowtie_{c.cust\_no=o.cust\_no} ((\sigma_{date>"31-12-2022" \wedge date<"01-01-2024} (Order)) \bowtie_{o.order\_no=c.order\_no} (Contains \bowtie_{c.sku=p.sku} (\sigma_{price>50} (product)))))$

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

$ Emp ← Employee \bowtie_{e.ssn=p.ssn} (process \bowtie_{p.order\_no=o.order\_no} (\sigma_{date>"31-12-2022" \wedge date<"01-02-2023} (Order))) $

$ Storehouse ← \rho_{Storehouse}(Warehouse) $

$ a ← \Pi_{name} (Employee \bowtie_{e.ssn=w.ssn} (\Pi_{ssn} (works) \bowtie_{w.adress=s.adress} (Storehouse)))$

$ b ← \Pi_{name} (Employee \bowtie_{e.ssn=w.ssn} (\Pi_{ssn} (works) \bowtie_{w.adress=o.adress} (Office)))$

$Ewh = a - b$

$ \Pi_{name} (Emp \cap Ewh) $

3. Indique o nome do produto mais vendido;

$ \Pi_{name} (Product \bowtie_{p.sku=c.sku} (_{cs.qty} G _{Max(cs.qty)} (contains \bowtie_{cs.order\_no=s.order\_no} (Sale)))) $

4. Indique o valor total de cada venda realizada.

$ _{order\_no} G _{Sum(qty*price)} (\Pi_{order\_no,qty*price} (Sale) \bowtie_{c.order\_no=g.order\_no} (contains) \bowtie_{c.sku=p.sku} (Product)) $

## 3 Tradução do Modelo Relacional para SQL

### 3.1 Esquema Relacional (schema.sql)

Crie uma base de dados SQL correspondente ao esquema Relacional desenvolvido no ponto anterior.
Utilizando a linguagem SQL (DDL), apresente as instruções para criar o esquema de bases de dados correspondente ao modelo relacional desenvolvido. Deve certificar-se de que os tipos de dados e tamanhos de campo selecionados sejam os mais apropriados. As restrições aplicáveis a cada campo, linha e tabela também devem ser especificadas recorrendo às instruções NOT NULL, CHECK, PRIMARY KEY, UNIQUE e FOREIGN KEY conforme seja apropriado.


Nota: Apresente todas as restrições existentes no modelo Relacional que não podem ser capturadas (implementadas) no esquema SQL, escrevendo-as como comentários na tabela respectiva.

In [ ]:
%load_ext sql
%sql postgresql://db:db@postgres/db

In [9]:
%%sql

-- schema.sql

DROP TABLE IF EXISTS Customer CASCADE;
DROP TABLE IF EXISTS "order" CASCADE;
DROP TABLE IF EXISTS Sale CASCADE;
DROP TABLE IF EXISTS pay CASCADE;
DROP TABLE IF EXISTS Employee CASCADE;
DROP TABLE IF EXISTS process CASCADE;
DROP TABLE IF EXISTS Department CASCADE;
DROP TABLE IF EXISTS Workplace CASCADE;
DROP TABLE IF EXISTS Office CASCADE;
DROP TABLE IF EXISTS Warehouse CASCADE;
DROP TABLE IF EXISTS delivery CASCADE;
DROP TABLE IF EXISTS works CASCADE;
DROP TABLE IF EXISTS Product CASCADE;
DROP TABLE IF EXISTS EAN_Product CASCADE;
DROP TABLE IF EXISTS contains CASCADE;
DROP TABLE IF EXISTS supply_contract CASCADE;
DROP TABLE IF EXISTS supplier CASCADE;



CREATE TABLE Customer (
    cust_no SERIAL,
    name VARCHAR(80) NOT NULL,
    email VARCHAR(80) NOT NULL UNIQUE,
    phone VARCHAR(40) NOT NULL,
    address VARCHAR(255),
    PRIMARY KEY(cust_no)
);

CREATE TABLE "order" (
   order_no SERIAL,
   date DATE NOT NULL,
   cust_no INTEGER NOT NULL,
   PRIMARY KEY(order_no),
   FOREIGN KEY(cust_no) REFERENCES Customer(cust_no)
); -- For each order, there must be an entry in the contains table with the same order_no

CREATE TABLE Sale (
  order_no INTEGER,
  PRIMARY KEY(order_no),
  FOREIGN KEY(order_no) REFERENCES "order"(order_no) ON DELETE CASCADE
);

CREATE TABLE pay(
  order_no INTEGER,
  cust_no INTEGER NOT NULL,
  PRIMARY KEY(order_no),
  FOREIGN KEY(order_no) REFERENCES "order"(order_no),
  FOREIGN KEY(cust_no) REFERENCES Customer(cust_no)
); -- Customers can only pay for orders they have made

CREATE TABLE Employee(
  ssn INTEGER,
  TIN INTEGER NOT NULL UNIQUE,
  bdate DATE NOT NULL,
  name VARCHAR(80) NOT NULL,
  PRIMARY KEY (ssn)
); -- For each employee, there must be an entry in the works table with the same ssn

CREATE TABLE process(
  ssn INTEGER,
  order_no INTEGER,
  PRIMARY KEY(ssn, order_no),
  FOREIGN KEY(ssn) REFERENCES Employee(ssn),
  FOREIGN KEY(order_no) REFERENCES "order"(order_no)
); 

CREATE TABLE Department(
  name VARCHAR(50),
  PRIMARY KEY(name)
); 

CREATE TABLE Workplace(
  address VARCHAR(100),
  lat VARCHAR(20) NOT NULL,
  long VARCHAR(20) NOT NULL,
  PRIMARY KEY(address),
  UNIQUE(lat, long)
);

Create TABLE Office(
  address VARCHAR(100),
  PRIMARY KEY(address),
  FOREIGN KEY(address) REFERENCES Workplace(address) ON DELETE CASCADE
); 

CREATE TABLE Warehouse(
  address VARCHAR(100),
  PRIMARY KEY(address),
  FOREIGN KEY(address) REFERENCES Workplace(address) ON DELETE CASCADE
);

CREATE TABLE works(
  ssn INTEGER,
  name VARCHAR(50),
  address VARCHAR(100),
  PRIMARY KEY(ssn, name, address),
  FOREIGN KEY(ssn) REFERENCES Employee(ssn),
  FOREIGN KEY(name) REFERENCES Department(name), 
  FOREIGN KEY(address) REFERENCES Workplace(address)
); 

CREATE TABLE Product(
  sku SERIAL,
  name VARCHAR(100) NOT NULL,
  description VARCHAR(255) NOT NULL,
  price DECIMAL(10,2) NOT NULL,
  PRIMARY KEY(sku)
); -- For each product, there must be an entry in the supply_contract table with the same sku

CREATE TABLE EAN_Product(
  sku INTEGER,
  ean VARCHAR(15) NOT NULL UNIQUE,
  PRIMARY KEY(sku),
  FOREIGN KEY(sku) REFERENCES Product(sku) ON DELETE CASCADE
); 

CREATE TABLE contains(
  sku INTEGER,
  order_no INTEGER,
  quantity INTEGER NOT NULL,
  PRIMARY KEY(sku, order_no),
  FOREIGN KEY(sku) REFERENCES Product(sku),
  FOREIGN KEY(order_no) REFERENCES "order"(order_no)
);

CREATE TABLE Supplier(
  TIN INTEGER,
  name VARCHAR(80) NOT NULL,
  address VARCHAR(100) NOT NULL,
  PRIMARY KEY(TIN)
); -- For each supplier, there must be an entry in the supply_contract table with the same TIN

CREATE TABLE supply_contract(
  TIN INTEGER,
  sku INTEGER NOT NULL,
  PRIMARY KEY(TIN),
  FOREIGN KEY(TIN) REFERENCES Supplier(TIN),
  FOREIGN KEY(sku) REFERENCES Product(sku)
); 

CREATE TABLE delivery(
  address VARCHAR(100),
  TIN INTEGER,
  PRIMARY KEY(address, TIN),  
  FOREIGN KEY(address) REFERENCES Workplace(address),
  FOREIGN KEY(TIN) REFERENCES supply_contract(TIN)
);

UsageError: Cell magic `%%sql` not found.

### 3.2 Carregamento da Base de Dados

Crie um script SQL (DML) com todas as instruções INSERT necessárias para criar alguns dados de teste sintéticos para facilitar a validação dos resultados esperados das consultas (lembre-se de que cada tabela deve conter pelo menos uma linha e que todas as consulta têm de retornar um resultado não vazio).

In [4]:
%%sql
-- populate.sql

insert into Customer (name, email, phone, address) VALUES ('Belchior', 'belchiorlindo@gmail.com', '912345678', 'Rua do Belchior');
insert into Customer (name, email, phone, address) VALUES ('Nunes', 'danielnunes@gmail.com', '939393939', 'Rua do Nunes');
insert into Customer (name, email, phone, address) VALUES ('Costa', 'joaolscosta@gmail.com', '947854684', 'Rua das flores');

insert into "order" (date, cust_no) VALUES ('2017-01-01', (select cust_no from Customer where name = 'Belchior'));
insert into "order" (date, cust_no) VALUES ('2018-01-01', (select cust_no from Customer where name = 'Nunes'));
insert into "order" (date, cust_no) VALUES ('2019-01-01', (select cust_no from Customer where name = 'Costa'));
insert into "order" (date, cust_no) VALUES ('2014-01-01', (select cust_no from Customer where name = 'Costa'));
insert into "order" (date, cust_no) VALUES ('2023-01-02', (select cust_no from Customer where name = 'Costa'));
insert into "order" (date, cust_no) VALUES ('2023-02-02', (select cust_no from Customer where name = 'Nunes'));
insert into "order" (date, cust_no) VALUES ('2023-01-03', (select cust_no from Customer where name = 'Nunes'));

insert into Sale (order_no) VALUES ((select order_no from "order" where date = '2017-01-01'));
insert into Sale (order_no) VALUES ((select order_no from "order" where date = '2018-01-01'));

insert into pay (order_no, cust_no) VALUES ((select order_no from "order" where date = '2017-01-01'), (select cust_no from Customer where name = 'Belchior'));
insert into pay (order_no, cust_no) VALUES ((select order_no from "order" where date = '2018-01-01'), (select cust_no from Customer where name = 'Nunes'));

insert into Employee (ssn, TIN, bdate, name) VALUES ('546654654', '123123123', '2002-04-10', 'Pedrinho');
insert into Employee (ssn, TIN, bdate, name) VALUES ('546654655', '123123124', '2002-02-14', 'Gui');
insert into Employee (ssn, TIN, bdate, name) VALUES ('546654656', '123123125', '2002-01-01', 'Luana');

insert into process (ssn, order_no) VALUES ((select ssn from Employee where name = 'Pedrinho'), (select order_no from "order" where date = '2017-01-01'));
insert into process (ssn, order_no) VALUES ((select ssn from Employee where name = 'Luana'), (select order_no from "order" where date = '2023-01-02'));
insert into process (ssn, order_no) VALUES ((select ssn from Employee where name = 'Gui'), (select order_no from "order" where date = '2019-01-01'));
insert into process (ssn, order_no) VALUES ((select ssn from Employee where name = 'Gui'), (select order_no from "order" where date = '2023-01-03'));
insert into process (ssn, order_no) VALUES ((select ssn from Employee where name = 'Pedrinho'), (select order_no from "order" where date = '2014-01-01'));

insert into Department (name) VALUES ('Sales');
insert into Department (name) VALUES ('Marketing');
insert into Department (name) VALUES ('Production');

insert into Workplace (address, lat, long) VALUES ('Rua das flores', '123', '456');
insert into Workplace (address, lat, long) VALUES ('Rua da Maria', '789', '1010');
insert into Workplace (address, lat, long) VALUES ('Rua da Lua', '789', '1012');
insert into Workplace (address, lat, long) VALUES ('Rua do Sol', '789', '1011');

insert into Office (address) VALUES ('Rua da Lua');
insert into Office (address) VALUES ('Rua do Sol');

insert into Warehouse (address) VALUES ('Rua das flores');
insert into Warehouse (address) VALUES ('Rua da Maria');


insert into works (ssn, name, address) VALUES ((select ssn from Employee where name = 'Pedrinho'), (select name from Department where name = 'Sales'), (select address from Office where address = 'Rua da Lua'));
insert into works (ssn, name, address) VALUES ((select ssn from Employee where name = 'Luana'), (select name from Department where name = 'Marketing'), (select address from Warehouse where address = 'Rua das flores'));
insert into works (ssn, name, address) VALUES ((select ssn from Employee where name = 'Gui'), (select name from Department where name = 'Production'), (select address from Warehouse where address = 'Rua das flores'));
insert into works (ssn, name, address) VALUES ((select ssn from Employee where name = 'Gui'), (select name from Department where name = 'Production'), (select address from Office where address = 'Rua do Sol'));

insert into Product (name, description, price) VALUES ('Gaming Chair', 'Chair made with love and kindness', 5.35);
insert into Product (name, description, price) VALUES ('Cake', 'Cake made by our amazing chef Luana', 10.35);
insert into Product (name, description, price) VALUES ('TV', 'LG TV 4K', 500.35);
insert into Product (name, description, price) VALUES ('Table', 'Table made with paus and cola', 50.35);

insert into EAN_Product (sku, ean) VALUES ((select sku from Product where name = 'Gaming Chair'), '1234567891234');
insert into EAN_Product (sku, ean) VALUES ((select sku from Product where name = 'Cake'), '1234567891235');
insert into EAN_Product (sku, ean) VALUES ((select sku from Product where name = 'TV'), '1234567891236');

insert into contains (sku, order_no, quantity) VALUES ((select sku from Product where name = 'Gaming Chair'), (select order_no from "order" where date = '2017-01-01'), 2);
insert into contains (sku, order_no, quantity) VALUES ((select sku from Product where name = 'Cake'), (select order_no from "order" where date = '2018-01-01'), 10);
insert into contains (sku, order_no, quantity) VALUES ((select sku from Product where name = 'TV'), (select order_no from "order" where date = '2019-01-01'), 3);
insert into contains (sku, order_no, quantity) VALUES ((select sku from Product where name = 'TV'), (select order_no from "order" where date = '2023-01-02'), 14);
insert into contains (sku, order_no, quantity) VALUES ((select sku from Product where name = 'TV'), (select order_no from "order" where date = '2023-01-03'), 3);

insert into Supplier (TIN, name, address) VALUES ('123456789', 'Goncalo', 'Rua da IKEA');
insert into Supplier (TIN, name, address) VALUES ('123456788', 'Rafael', 'Rua da LG');
insert into Supplier (TIN, name, address) VALUES ('123456787', 'Luana', 'Rua da Samsung');
insert into Supplier (TIN, name, address) VALUES ('123456786', 'Ricky', 'Rua da Apple');

insert into supply_contract (TIN, sku) VALUES ((select TIN from Supplier where name = 'Goncalo'), (select sku from Product where name = 'Gaming Chair'));
insert into supply_contract (TIN, sku) VALUES ((select TIN from Supplier where name = 'Luana'), (select sku from Product where name = 'Cake'));
insert into supply_contract (TIN, sku) VALUES ((select TIN from Supplier where name = 'Rafael'), (select sku from Product where name = 'TV'));
insert into supply_contract (TIN, sku) VALUES ((select TIN from Supplier where name = 'Ricky'), (select sku from Product where name = 'Table'));

insert into delivery (address, TIN) VALUES ((select address from Workplace where address = 'Rua das flores'), (select TIN from Supplier where name = 'Goncalo'));
insert into delivery (address, TIN) VALUES ((select address from Workplace where address = 'Rua da Maria'), (select TIN from Supplier where name = 'Luana'));
insert into delivery (address, TIN) VALUES ((select address from Workplace where address = 'Rua da Lua'), (select TIN from Supplier where name = 'Rafael'));
insert into delivery (address, TIN) VALUES ((select address from Workplace where address = 'Rua do Sol'), (select TIN from Supplier where name = 'Ricky'));

UsageError: Cell magic `%%sql` not found.

## 4 Linguagem SQL

Apresente a expressão SQL correspondente  a cada uma das interrogações de Álgebra Relacional.

1. Liste o nome de todos os clientes que fizeram encomendas contendo produtos de preço superior a €50 no ano de 2023;

In [5]:
%%sql

SELECT DISTINCT
  c.name
FROM 
  Customer c
INNER JOIN
  "order" o ON c.cust_no = o.cust_no
INNER JOIN
  contains cs ON o.order_no = cs.order_no
INNER JOIN
  Product p ON cs.sku = p.sku
WHERE
  p.price > 50
AND
  o.date > '2022-12-31'
AND
  o.date < '2024-01-01';

UsageError: Cell magic `%%sql` not found.

2. Liste o nome de todos os empregados que trabalham em armazéns e não em escritórios e processaram encomendas em Janeiro de 2023;

In [6]:
%%sql

WITH EJAN2023 AS
  (
    SELECT DISTINCT
      e.name
    From
      Employee e
    INNER JOIN
      process p ON e.ssn = p.ssn
    INNER JOIN
      "order" o ON p.order_no = o.order_no
    WHERE
      o.date > '2022-12-31'
    and
      o.date < '2023-02-01'
  ),

EWHA AS 
  (
    SELECT DISTINCT 
      e.name
    FROM 
      Employee e
    WHERE e.ssn IN (
      SELECT 
        w.ssn
      FROM 
        works w
      JOIN Warehouse wh ON w.address = wh.address
    )
    AND e.ssn NOT IN (
      SELECT 
        w.ssn
      FROM 
        works w
      JOIN Office o ON w.address = o.address
    )
  )

SELECT DISTINCT
  name
FROM
  EJAN2023
INTERSECT
  SELECT DISTINCT
    name
  FROM
    EWHA;

UsageError: Cell magic `%%sql` not found.

3. Indique o nome do produto mais vendido;

In [2]:
%%sql

with sold as (
  SELECT
    *
  FROM
    contains cs
  INNER JOIN
    sale s ON cs.order_no = s.order_no
),
bestseller as (
  SELECT
    s.sku
  FROM
    sold s
  GROUP BY
    s.sku
  HAVING 
    SUM(s.quantity) >= ALL (
      SELECT
        SUM(s.quantity)
      FROM
        sold s
      GROUP BY
        s.sku
  )
)
SELECT DISTINCT
  p.name
FROM
  bestseller bs
INNER JOIN
  Product p ON bs.sku = p.sku;

UsageError: Cell magic `%%sql` not found.

4. Indique o valor total de cada venda realizada.

In [8]:
%%sql

SELECT 
  query.order_no, SUM(query.total)
FROM
  (
    SELECT 
      s.order_no, ct.quantity*p.price as total
    FROM
      Product p
    INNER JOIN
      contains ct ON p.sku = ct.sku
    INNER JOIN
      sale s ON s.order_no = ct.order_no
  ) as query
GROUP BY
  query.order_no;

UsageError: Cell magic `%%sql` not found.